import 'package:flutter/material.dart';
class DiseaseListItem extends StatelessWidget {
  final String diseaseName;
  final Widget page;
  DiseaseListItem({
    required this.diseaseName,
    required this.page,
  });
  @override
  Widget build(BuildContext context) {
    return Container(
      width: 300,
      height: 100,
      decoration: BoxDecoration(
        color: Colors.white,
        borderRadius: BorderRadius.circular(16),
        boxShadow: [
          BoxShadow(
            color: Color(0x29000000),
            offset: Offset(0, 3),
            blurRadius: 3,
          ),
        ],
      ),
      child: Center(
        child: ListTile(
          title: Center(child: Text(diseaseName, style: TextStyle(fontSize: 16,fontWeight: FontWeight.bold,))),
          onTap: () {
            Navigator.push(
              context,
              MaterialPageRoute(builder: (context) => page),
            );
          },
        ),
      ),
    );
  }
}

class ZhongYaoBingLi extends StatelessWidget {
  final Map<String, Widget> diseasePages = {
    '感冒': GanmaoPage(),
    '直肠炎': ZhichangyanPage(),
    '高血压': HighBloodPressurePage(),
    '肝硬化': GanYingHuaPage(),
    '结肠炎': JieChangYanPage(),
    '大叶性肺炎': DaYeXingFeiYanPage(),
    '白血病': BaiXueBingPage(),
    '支气管炎': ZhiQiGuanYanPage(),
    '支气管哮喘': ZhiQiGuanXiaoChuanPage(),
    '支气管扩张': ZhiQiGuanKuoZhangPage(),
    '慢性胃炎': ManXingWeiYanPage(),
    '十二指肠溃疡': ShiErZhiChangKuiYangPage(),
    '痛风': TongFengPage(),
    '经期发热': JingQiFaRePage(),
    '经期失眠': JingQiShiMianPage(),
    '白带病': BaiDaiBingPage(),
    '痛经': TongJingPage(),
    '月经过多': YueJingGuoDuoPage(),
    '痤疮': CuoChuangPage(),
    '牙痛': YaTongPage(),
  };
  final List<Map<String, String>> diseases = [
    {'category': '内科疾病诊断', 'name': '感冒'},
    {'category': '内科疾病诊断', 'name': '直肠炎'},
    {'category': '内科疾病诊断', 'name': '高血压'},
    {'category': '内科疾病诊断', 'name': '肝硬化'},
    {'category': '内科疾病诊断', 'name': '结肠炎'},
    {'category': '内科疾病诊断', 'name': '大叶性肺炎'},
    {'category': '内科疾病诊断', 'name': '白血病'},
    {'category': '内科疾病诊断', 'name': '支气管炎'},
    {'category': '内科疾病诊断', 'name': '支气管哮喘'},
    {'category': '内科疾病诊断', 'name': '支气管扩张'},
    {'category': '内科疾病诊断', 'name': '慢性胃炎'},
    {'category': '内科疾病诊断', 'name': '十二指肠溃疡'},
    {'category': '外科疾病诊断', 'name': '痛风'},
    {'category': '妇科疾病诊断', 'name': '经期发热'},
    {'category': '妇科疾病诊断', 'name': '经期失眠'},
    {'category': '妇科疾病诊断', 'name': '白带病'},
    {'category': '妇科疾病诊断', 'name': '痛经'},
    {'category': '妇科疾病诊断', 'name': '月经过多'},
    {'category': '皮肤病诊断', 'name': '痤疮'},
    {'category': '五官科疾病诊断', 'name': '牙痛'},

  ];
  @override
  Widget build(BuildContext context) {
    Map<String, List<Map<String, String>>> groupedDiseases = {};
    diseases.forEach((disease) {
      String category = disease['category'] ?? '其他';
      groupedDiseases.putIfAbsent(category, () => []);
      groupedDiseases[category]!.add(disease);
    });

    return Scaffold(
      appBar: AppBar(
        title: Text('中医病理'),
        backgroundColor: Colors.purple[50], // 设置背景颜色为浅紫色
      ),
      body: ListView.builder(
        itemCount: groupedDiseases.length,
        itemBuilder: (context, categoryIndex) {
          String category = groupedDiseases.keys.elementAt(categoryIndex);
          List<Map<String, String>> categoryDiseases = groupedDiseases[category] ?? [];

          return Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  category,
                  style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                ),
              ),
              ListView.builder(
                shrinkWrap: true,
                physics: NeverScrollableScrollPhysics(),
                itemCount: categoryDiseases.length,
                itemBuilder: (context, index) {
                  final diseaseName = categoryDiseases[index]['name'] ?? '';
                  Widget page = diseasePages[diseaseName] ?? Container();

                  return Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: DiseaseListItem(
                      diseaseName: diseaseName,
                      page: page,
                    ),
                  );
                },
              ),
            ],
          );
        },
      ),
    );
  }
}

class YaTongPage extends StatelessWidget {
  const YaTongPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('牙痛'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n牙痛\n【别名】：\n暂无\n【疾病科别】：\n五官科\n【病理辨证】：\n中医认为：风热侵袭风火邪毒侵犯，伤及牙体及牙龈肉，邪聚不散，气血滞留，气穴不通，瘀阻脉络而为病。并且，手、足阳明经脉分别为下齿、上齿，大肠、胃腑积热或风邪外袭经络，郁于阳明而化火，火邪循经上炎而发牙痛。肾主骨，齿为骨之余，肾阴不足，虚火上炎亦可引起牙痛。亦有多食甘酸之物，口齿不洁，垢秽蚀齿而作痛者。因此，牙痛主因是气穴的通畅与否，次之与手足阳明经和肾经有关。中医认为牙痛是由于外感风邪、胃火炽盛、肾虚火旺、虫蚀牙齿等原因所致。牙痛的常见中医证型有风火型牙痛、风热型牙痛、胃火型牙痛、虚火型牙痛。\n1.风火型牙痛证候：证见牙齿痛，牙龈红肿疼痛，遇冷则痛减，遇风、热则痛甚，或有发热、恶寒、口渴、舌红、苔白干、脉浮数。\n证候分析：因于火者，系阳明伏火与风热之邪相搏，风火上炎致牙齿疼痛。患牙得凉痛减。治宜疏风、泻火、解毒。 \n辨证施治：治宜疏风清火，解毒消肿。\n2．风热型牙痛证候：证见牙齿疼痛，呈阵发性，遇风发作，患处得冷则痛减，受热则痛增，牙龈红肿，全身或有发热、恶寒、口渴，舌红、苔白干，脉浮数。\n证候分析：风热侵袭，火郁牙龈，瘀阻脉络，故牙齿疼痛，遇风发作，牙龈红肿；风热为阳邪，得冷则痛减，受热则更助风火而痛增。风邪外袭在表，与热相搏。\n辨证施治：宜疏风泄热。\n3．胃火型牙痛证候：证见牙齿痛甚，牙龈红肿，或出脓渗血，牵及颌面疼痛、头痛，口渴、口臭，大便秘结，舌红苔黄，脉滑数。\n证候分析：足阳明胃经循行人齿，胃火炽盛，循经上蒸齿龈，"人身之火，惟胃最烈"，火既升于齿牙，故牙齿痛，牙龈红肿较甚。火盛伤脉络则渗血，伤肌膜则化腐成脓。若火热结聚不散，则肿连腮颊；邪热上扰则头痛；热伤津液，故口渴引饮，大 便秘 结，口有臭气，舌苔黄厚，脉洪数均为胃腑热盛之象。\n辨证施治：治宜清胃泻火，方用清胃散等。\n4．虚火型牙痛证候：证见牙齿隐隐微痛，牙龈微红、微肿，久则牙龈萎缩、牙齿松动，伴有心烦失眠、眩晕，舌红嫩，脉细数。\n证候分析：肾阴虚，虚火上炎，结于齿龈，故牙齿隐隐作痛或微痛，牙龈微红，微肿。虚火长时灼烁，龈肉受损而失于濡养，发生萎缩。肾主骨，齿为骨之余，肾虚失于儒养，牙龈萎缩，则牙齿不固，而牙根浮动，咬物无力。午后阳明经气旺盛，更助虚火上炎，因此午后疼痛较重。腰为肾之府，肾阴虚则腰痠痛。阴虚髓海不足，故头晕眼花，虚火伤津，故咽干但不多饮。舌质红嫩，无浊苔，脉多细数，此为阴虚之表现。\n辨证施治：治宜滋阴降火。 \n【临床症状】：\n牙痛是一种常见疾病。其表现为：牙龈红肿、遇冷热刺激痛、面颊部肿胀等。早期，牙龈发痒、不适、口臭，继之牙龈红肿、松软，容易出血，疼痛，反复发作。日久牙龈与牙根部的牙周膜被破坏，形成一个袋子，叫牙周袋，袋内常有脓液溢出，炎症继续扩大，可成为牙周脓肿，病情加重，局部疼痛、肿胀，初为硬性，后变为软性，有波动感，可自行穿破，流出脓液，出脓后，疼痛可减轻，或反复发作，非常痛苦。\n【注意事项】：\n（1）注意口腔卫生，养成“早晚刷牙，饭后漱口”的良好习惯。\n（2）发现蛀牙，及时治疗。\n（3）睡前不宜吃糖、饼干等淀粉之类的食物。\n（4）宜多吃清胃火及清肝火的食物，如南瓜、西瓜、荸荠、芹菜、萝卜等。\n（5）忌酒及热性动火食品。\n（6）脾气急躁，容易动怒会诱发牙痛，故宜心胸豁达，情绪宁静。\n（7）保持大便通畅，勿使粪毒上攻。\n（8）勿吃过硬食物，少吃过酸、过冷、过热食物。\n（9）针刺除龋齿为暂时止痛外，对一般牙痛效果良好。\n（10）应与三叉神经痛相鉴别。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class CuoChuangPage extends StatelessWidget {
  const CuoChuangPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('痤疮'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n痤疮\n【别名】：\n痤疮,青春痘,粉刺\n【疾病科别】：\n皮肤性病科\n【病理辨证】：\n中医认为痤疮是血中有血热存在，血中之毒是由五脏蕴热，注入血脉。另外经络中血气不和，外来湿邪、热邪损伤人体血液，导致痤疮。中医在临床上将痤疮分：湿热症，内毒血热症、血虚风燥症。中医分层疗法，遵循辩证施治，以清热解毒、消痈散结首要目标，尽早恢复机体阴平阳秘状态。 痤疮（青春痘）的辨证分型主要分为肺经蕴热、脾胃湿热、血瘀痰凝、冲任不调。\n1、肺经蕴热证候：主要表现为粉刺初起，红肿疼痛，面部瘙痒，可有口干，小便黄，大便干燥，舌红苔黄，脉象浮数。\n证候分析：中医学认为，面鼻为肺胃二经所主，若素体阳热偏盛，肺经郁热，又复受风邪（风易袭上位），则发“肺风粉刺”；肺与大肠相表里，若腑气不通，湿热上攻于面部，则亦发痤疮。\n辨证施治：治疗以清肺凉血为主，常用的方剂是枇粑清肺饮，主要药物有：枇粑叶，桑白皮，知母，黄芩，银花，赤勺，生地，生石膏，生甘草等。\n2、脾胃湿热证候：主要表现为粉刺此起彼伏，连绵不断，可以挤出黄白色碎米粒样脂栓，或有脓液，颜面出油光亮，拌口臭口苦，食欲时好时坏，大便粘滞不爽，舌红苔黄腻，脉弦数\n证候分析：中医学认为，面鼻为肺胃二经所主，若素体阳热偏盛，肺经郁热，又复受风邪（风易袭上位），则发“肺风粉刺”；肺与大肠相表里，若腑气不通，湿热上攻于面部，则亦发痤疮。\n辨证施治：治疗以清利湿热为主，常用的方剂是芩连平胃散，主要药物有：黄连，黄芩,白术，厚朴，蛇舌草，茵陈，六一散，生甘草等。\n3、血瘀痰凝证候：主要表现为痤疮日久，质地坚硬难消，触压有疼痛感，或者颜面凹凸如橘子皮，女性可有月经量少，痛经，经期痤疮加重等症状，舌暗苔薄，脉涩.。型多见于长期的慢性痤疮患者。\n证候分析：多见于结节型，聚合型痤疮。患者湿痰较甚，气滞血瘀，热毒痰瘀胶结致皮疹经久不愈，皮损色暗红，质硬，或质软有弹性。舌红或暗红，边有瘀点或瘀斑，脉弦或涩。\n辨证施治：治疗以活血化痰，软坚散结为主，常用的方剂是大黄蛰虫散，主要的药物有：大黄，蛰虫，水蛭，蛇舌草，桃仁，红花，益母草，陈皮，白术，生甘草等。\n4.冲任不调证候：主要表现为月经不调，小腹胀痛，或经来皮疹增多和加重，舌红、脉弦。偏阴虚者，常伴腰酸痛，五心烦热、口干渴等。偏阳虚者常见四肢不温，平素畏冷，面色白，唇淡，经行小腹冷痛，得热则减，舌暗淡，苔白，有齿印，脉沉。\n证候分析：本型常见于青春期后发病的患者。冲任隶属于肝肾，月事来潮前，经血充盈，易为肝气所激惹，气有余便是火，火性炎上，炼津为痰，形成痤疮，故患者皮损常经前加重。肾主封藏，肝肾藏泄失调，可致月事紊乱，内分泌失调而发痤疮。肾有阴虚、阳虚之分，如患者伴有手足心热，盗汗等全身症状多由于肾阴虚，虚火上炎所致，治以滋阴降火；如患者伴有手足凉，行经腹痛，月事有血块，多属肾阳虚，虚阳浮越，治以清上温下，引火归原。又因肝肾同源，故在治疗上应兼顾彼此，滋肾阴不忘清肝火，温肾阳同时暖肝阳。\n辨证施治：治疗以调和冲任为主，阴虚者常用成药为知柏地黄丸，阳虚者以龟鹿补肾丸。膳食：生地麦冬大骨汤，当归生姜羊肉汤。 \n 【注意】：痤疮的病理病机原因诸多，产生的原因不一，症型较多，切不可胡乱用药或涂抹于患处，应到医生处进行辨证诊治，房能彻底消除症状。\n【临床症状】：\n痤疮（青春痘）多发于青春期，通常好发于面部、颈部、胸背部、肩膀和上臂。一般在25岁以后自然趋向痊愈，所以不必放在心上；有的人数量多，表现为丘疹、黑头、脓疱、脓肿、结节、囊肿，甚至瘢痕。其临床症状因个体的反应不同，痤疮造成的损害程度也有不同，其临床的表现也不一样。有些人只出现轻微的粉刺，有些人却是出现严重的囊肿，留下色素沉着和疤痕。\n【注意事项】：\n第一、调节胃肠功能，保持大便通畅，有利于本病的康复。\n第二、注意休息，保持良好的睡眠及心理状态。\n第三、保持精神愉快。长了青春痘，不要产生心理负担，以免引起神经内分泌紊乱，使病情加重。\n第四、千万不要随意用手挤压青春痘， 用手挤压容易引起炎症扩散，加重病情甚至留下疤痕。\n第五、注意面部清洁，保持毛囊皮脂腺导管的通畅。每日早晚用温水洗脸，因为冷水不易去除油脂，热水促进皮脂分泌，不用刺激性肥皂。洗脸次数不宜过多，以免破坏正常的皮脂膜。\n第六、不宜选用油质化妆品，慎用防晒霜、遮盖霜及粉底等。尽量选用补水性好的柔肤水，油性皮肤多充水分可达到平衡油脂分泌，改善油性皮肤的作用。\n第七、饮食方面要多吃蔬菜和水果，少吃脂肪、糖类和辛辣等刺激性食物。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class YueJingGuoDuoPage extends StatelessWidget {
  const YueJingGuoDuoPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('月经过多'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n月经过多\n【别名】：\n暂无\n【疾病科别】：\n妇产科\n【病理辨证】：\n月经量较以往明显增多，每次经量超过80毫升以上，周期基本正常者，称为“月经过多”。常伴月经先期，属月经病。中医认为本病的主要病因病理是气虚统摄无权，血热经血妄行和血瘀阻滞，新血不得归经。以月经量多而周期、经期正常为辨证要点，结合经色和经质的变化以及全身的证候分辨虚实、寒热。治疗要注意经时和平时的不同，平时治本是调经，经时固冲止血需标本同治。月经过多的中医辩证分型有以下几种：\n （1）气虚型症状：行经量多，色淡红，质清稀，神疲体倦，气短懒言，小腹空坠，面色觥白，舌淡，苔薄，脉缓弱。 \n证候分析：气虚则冲任不固，经血失于制约，故经行量多；气虚火衰不能化血为赤，故经色淡红，质清稀；气虚中阳不振，故神疲体倦，气短懒言；气虚失于升提，故小腹空坠；气虚阳气不布，故面色光白。舌淡，苔薄，脉缓弱，也为气虚之象。 \n辨证施治：补气摄血，调经止血。\n （2）血热型症状：实热者经行量多，色红黏稠有块，口干喜冷饮，心烦易怒，便秘尿赤。苔黄，舌红脉弦带数。阴虚内热者伴口干咽燥，头晕耳鸣，腰膝酸软。舌红，脉细数无力。\n证候分析：阳热内盛，伏于冲任，经行之际，热迫血行，故经行量多；血为热灼，故经色红而质稠；热邪伤津，则口渴饮冷，尿黄便结；热扰心神，故心烦多梦。舌红，苔黄，脉滑数，为血热之征。\n辨证施治：清热凉血，调经止血。\n （3）血瘀型症状：经行量多，色紫黯，质稠有血块，经行腹痛，或平时小腹胀痛，舌紫黯或有瘀点，脉涩有力。 \n证候分析：瘀血阻于冲任，新血难安，故经行量多；瘀血内结，故经色紫黯有块；瘀阻胞脉，“不通则痛”，故经行腹痛，或平时小腹胀痛。舌紫黯或有瘀点，脉涩有力，为血瘀之征。 \n辨证施治：活血化瘀，调经止血。\n【临床症状】：\n医生认为正常的月经出血应为20～60毫升，超过80毫升为月经过多。以卫生巾的用量大概估计，正常的用量是平均一天换四五次，每个周期不超过两包（每包10片计）。假如用3包卫生巾还不够，而且差不多每片卫生巾都是湿透的，就属于经量过多。\n【注意事项】：\n1.精神情绪可以影响丘脑下部的内分泌调节功能，导致月经失调，经量过多。肝主藏血，又有疏泄调达功能，如果情志不畅，肝失疏泄功能，也可引起月经过多。故情绪舒畅可防止月经失调和月经过多。\n同时平时还应注意饮食调养，保持机体正气充足，也可防止月经过多。\n2.月经过多如不及时治疗或治疗不当，伴发月经周期和经期紊乱，则可发展为崩漏。如果月经过多的病程较长，或经量多如注，会引起血虚（贫血），脏腑失去血的滋养。\n3.月经血是子宫内膜周期性剥落出血，中医认为是胞宫执行“泻”的功能，即行月经，故月经血要下行通畅，而血量又不宜过多，由此治疗月经过多时，在月经的头三天内以减少血量为妥，如果一下子使用大剂量的止血药，尤其是炭类止血药，虽然出血已止，但常有下腹胀坠不适等症，继而又淋漓出血不止，导致经期延长，这一要点在临床上常被疏忽的。\n4.月经过多时病人有紧张恐惧情绪，因此要安慰和安定病人的情绪，配合治疗。血止后根据病人的全身情况进行中药调养，调整脏腑气血功能，防止月经过多发生。\n5.有内科疾病者，如肝病、血液病者应同时治疗内科病。因为这类病人的月经病是由内科病引起的，所以当先治病为主，病愈经亦能自调。\n6.提倡劳逸结合，尤其在经期更要适当休息。平时加强体质锻炼，增强脏腑功能。\n7、适劳逸要积极从事劳动(体力和脑力劳动)，但不宜过度劳累和剧烈运动，过则易伤脾气，可导致统摄失职或生化不足而引起的月经疾病。\n8、节育和节欲要重视节制生育和节欲防病，避免生育(含人流)过多过频及经期、产后交合，否则损伤冲任、精血、肾气，导致月经疾病。上述各项在平时应多加注意，在经期、产后更要重视，既可减少或防止本病的发生。\n9、适寒温要根据气候环境变化，适当增减衣被，不要过冷过凉，以免招致外邪，损伤血气，引起月经疾病。\n10、节饮食要注意饮食应定时定量，不宜暴饮暴食或过食肥甘油腻、生冷寒凉、辛辣香燥之品以免损伤脾胃而至生化不足，或聚湿生痰或凉血、灼血引起月经不调。\n11、调情志要保持心情舒畅，避免忧思郁怒，损伤肝脾，或七情过极，五志化火，扰及冲任而为月经疾病。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class TongJingPage extends StatelessWidget {
  const TongJingPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('痛经'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n痛经\n【别名】：\n暂无\n【疾病科别】：\n妇产科\n【病理辨证】：\n痛经病位在胞宫，变化在气血，表现为痛证，多因气血运行不畅，不通则痛。中医认为，痛经主要病机在于邪气内伏，经血亏虚，导致胞宫的气血运行不畅，“不通则痛”；或胞宫失于濡养，“不荣则痛”，因此导致痛经。 常见证型有气血虚弱、气滞血瘀、湿热阻络和寒湿凝滞。\n （1）气血虚弱型症状：经期或经净后，小腹隐痛、喜揉按，月经色淡量少，质稀，伴神疲乏力，面色苍白，舌淡苔薄，脉虚细。 \n证候分析：体虚气血不足，经行后血海空虚，胞脉失养，或体虚阳气不振，运血无力，故见经期或经净后小腹隐痛，喜揉按；气虚阳气不充，血虚精血不荣，故经血色淡量少，质稀。余症亦为血虚气弱之象。\n辨证施治：应服具有益气补血止痛作用的药物。\n （2）气滞血瘀型症状：每于经前一、二日或经期小腹胀痛、拒按，经血量少，或排出不畅，经色紫暗有块，血块排出则疼痛减轻，胸胁乳房作胀，舌质紫暗，舌边或有瘀点，脉沉弦。\n证候分析：冲住气血郁滞，气血运行欠畅通，故经前或经期少腹胀痛、拒按，经量少或排出不畅；经血瘀滞，故色暗有块；块下瘀滞稍通，故疼痛暂减；瘀滞随经血而外泄，故经后疼痛自消。但若郁滞之因未除，则下次经期腹痛复发。舌质紫暗，脉沉弦，均为气滞血瘀之象。\n辨证施治：舒肝理气、化淤止痛。\n （3）湿热下注型症状：经前、经期少腹胀痛，经量多，色红，质稠或有块，平日带下色黄或有秽臭，舌红苔黄腻，脉弦数。 \n证候分析：外感或内蕴湿热，流注冲任，阻滞气血，经行不畅，故经来腹痛；热扰冲任，则量多色红有块；热灼津液，则经水质稠；湿热下注，伤及任带，则平日带下色黄或有秽臭。舌脉均为湿热内盛之象。 \n辨证施治：清热除湿，调经止痛。\n （4）寒湿凝滞型症状：经前或经期小腹冷痛，得热痛减，按之痛甚，经量少，色暗黑有块，恶心呕吐，畏寒，便溏，苔白腻，脉沉紧。 \n证候分析：寒湿之邪伤及下焦，客于胞中，血被寒凝，行而不畅，因而作痛，经血色暗黑而有块；寒湿中阻，阳气被遏，水湿不运，则畏寒便溏，恶心呕吐。余症均为寒湿阻滞所致。\n辨证施治：温经和营，调经止痛。\n【临床症状】：\n痛经是妇科常见病和多发病，病因多，病机复杂，反复性大，治疗棘手，尤其是未婚女青年及月经初期少女更为普遍，表现为妇女经期或行经前后，大多开始于月经来潮或在阴道出血前数小时，周期性发生下腹部胀痛、冷痛、灼痛、刺痛、隐痛、坠痛、绞痛、痉挛性疼痛、撕裂性疼痛，疼痛延至骶腰背部，甚至涉及大腿及足部，历时1/2～2小时。疼痛部位多在下腹部，重者可放射至腰骶部或股内前侧。约有50%以上病人伴有全身症状：乳房胀痛、肛门坠胀、胸闷烦躁、悲伤易怒、心惊失眠、头痛头晕、恶心呕吐、胃痛腹泻、倦怠乏力、面色苍白、四肢冰凉、冷汗淋漓、虚脱昏厥等症状。在剧烈腹痛发作后，转为中等度阵发性疼痛，约持续12～24小时。经血外流畅通后逐渐消失，亦偶有需卧床2～3天者。\n【注意事项】：\n1．注意并讲究经期卫生，经前期及经期少吃生冷和辛辣等刺激性强的食物。\n2．平时要加强体育锻炼，尤其是体质虚弱者。还应注意改善营养状态，并要积极治疗慢性疾病。\n3．消除对月经的紧张、恐惧心理，解除思想顾虑，心情要愉快。可以适当参加劳动和运动，但要注意休息。\n4．疼痛发作时可对症处理，可服用阿托品片及安定片，都可缓解疼痛。长期不能缓解的，可作适当的中医辨证调理。另外，喝一些热的红糖姜水也会收到良好效果。\n5.特别要引起重视和警惕的是育龄期妇女月经期伴腹痛，不能一概诊断痛经，要先要弄清腹痛的原因，有几种可能性：与痛经有关的疾病，如子宫内膜异位症、慢性盆腔炎、宫腔黏连等。与痛经无关的疾病，但需要鉴别的，如宫外孕、盆腔肿瘤破裂、急性阑尾炎、肠黏连、急性肠炎等。故应仔细询问病史、妇科检查万超、尿妊娠试验、血常规等必要的化验检查项目，慎防耽误诊断和治疗。\n6.痛经的中医治疗，在经期腹痛时，应以理气和血止痛为主，要使经血下行畅通，注意不用或少用炭类止血药，因炭类止血药有收敛止血，使经血凝滞下行不通，有加重痛经可能。经净后可辨证调治，或用中成药，或服汤药，酌情而定。\n7.经期或经前恣饮冷食或感受风寒、淋而涉水都可能引起痛经，故经前或经期应避免冷饮，衣服要保暖，避免淋雨或游泳，可以预防痛经和防止痛经病情严重发展。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class BaiDaiBingPage extends StatelessWidget {
  const BaiDaiBingPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('经期失眠'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n白带病\n【别名】：\n暂无\n【疾病科别】：\n妇产科\n【病理辨证】：\n生理性白带：在正常情况下，阴道和外阴经常有少量分泌物以保持湿润，称之谓白带；是由阴道粘膜渗出物、宫颈腺体及子宫内膜分泌物组成，且含阴道上皮脱落细胞、白细胞。呈白色稀糊状或蛋清样，高度粘稠，无腥臭味，量少，对妇女健康无不良，称为生理性白带。\n病理性白带：妇女阴道内流出白色如涕如唾之黏液，伴全身或局部症状者，称为“病理性白带”，多属体虚或痰湿所致，相当于西医的阴道炎，但是白带常规检查常找不到致病菌。中医认为，本病发生的原因主要是由于脾虚肝郁、湿热下注，或肾气不足，下元亏损所致。辨证分型可以分为脾虚和肾虚两类。\n （1）脾虚型症状：带多色白，稀薄不臭，面色皖白，乏力倦怠，纳少便搪，或躯体肥胖。苔薄，舌淡胖，脉儒细。 \n证候分析：素体脾虚或伤食损脾，或痰湿阻脾，脾虚生湿，带脉失约而致湿浊下注，带下异常。\n辨证施治：健脾利湿止带。\n （2）肾虚型症状：带多色白如水清澈，腰酸膝软，头晕目眩，倦怠乏力，四肢不温，便溏尿频。苔薄，脉沉细。\n证候分析：素体肾虚，或房事过频、多产伤肾，肾虚带脉不固而致带多色白。 \n辨证施治：益肾补气止带。\n  \n【临床症状】：\n白带是由前庭大腺、子宫颈腺体、子宫内膜的分泌物和阴道粘膜的渗出液、脱落的阴道上皮细胞混合而成。一般月经中期白带增多，稀薄透明；排卵后白带又变粘稠，混浊而量少。经前及孕期白带均有所增多。如果白带的色、质、量发生异常改变，称为白带异常。临床上大部分妇女白带异常都是由于不注意个人卫生引起，正常人用清水清洁外阴即可。\n【注意事项】：\n1.本病由体虚引起，故除了药物治疗外，还须增加适当的体育活动，增强体质。\n2.适当增加营养，多吃蛋白质和维生素类食物，充实脏腑气血功能。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class JingQiShiMianPage extends StatelessWidget {
  const JingQiShiMianPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('经期发热'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n经期失眠\n【别名】：\n经行失眠\n【疾病科别】：\n妇产科\n【病理辨证】：\n“经行失眠”多见于育龄期妇女。每遇经前或经行失眠不安为主证，但经后睡眠正常者。本病若治疗不当，失眠逐渐严重，甚至彻夜不眠可发展为精神异常。属中医的经行前后诸证。经行失眠的基本病理是心肝火旺和心脑失养而致，其辨证分型可以分为阴虚火旺、心肝火旺和心脾失养三种。\n （1）阴虚火旺型症状：  经行或经前失眠心烦，经量多，色红，先期，口干咽燥。苔薄，舌尖红，脉细数。\n证候分析： 阴血亏虚，心火偏旺，心阴不足，心脑失养而致。\n辨证施治：养阴清火宁神。\n （2）心肝火旺型症状：  经前彻夜不寐，心烦易怒，头痛头胀，乳胀经多。苔黄，舌尖红，脉弦。\n证候分析：久郁伤肝化火，心肝火旺，火旺伤阴，心火益盛而致。\n辨证施治：清肝泻火安神。\n （3）心脾失养型症状：  经行或经后失眠，或彻夜不寐，头晕目眩，心悸健忘，神疲乏力。苔薄，舌淡，脉细弱。 \n证候分析：经前思虑过度，劳伤心脾，加上经血过多，心失血养，而致失眠。 \n辨证施治：健脾养心宁神。\n【临床症状】：\n经行失眠（经期失眠），临床表现为经期来临之前失眠或月经期失眠，但是月经期过后又恢复正常睡眠的病症，中医学辨证分析其病理为心肝火旺和心脑失养。\n【注意事项】：\n1.中药宜在经前3～5天服，头煎宜在睡前2小时服。\n2.解除病员睡前忧虑紧张的思想情绪。\n3.饮食宜清淡可口，易于消化，忌服膏粱厚味之品。适当安排劳逸时间，避免过度劳累，影响睡眠。\n4.失眠者易东想西想，思路紊乱，如遇精神创伤容易诱发精神异常。故失眠者应摆脱不愉快情绪，保持心情愉快，失眠会逐渐好转。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class JingQiFaRePage extends StatelessWidget {
  const JingQiFaRePage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('经期发热'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n经期发热\n【别名】：\n经行发热\n【疾病科别】：\n妇产科\n【病理辨证】：\n“经行发热”为每逢经期或经行前后出现以发热为主证，经净后发热自然退净或稍退者。以育龄期妇女多见。主要发病机理是气血营卫失调，导致月经的生理改变而发。多因经期感受外邪、阴虚生热、血虚挟滞或血热外泛等所致。其分型有气虚、阴虚、血热和淤热。常伴发于盆腔炎、子宫内膜异位症等疾病。\n （1）气虚型证候：经行低热持续，动则汗出，懒言少语，面色?s白，经行量多，色淡质清稀。苔薄，舌淡，脉细缓而数。\n证候分析： 禀赋气弱，经行时气随血耗，营卫失调而致发热。\n辨证施治：补中益气除热。\n （2）阴虚型证候：经期午后潮热，两颧红赤，五心烦热，烦躁少眠。舌红干，脉细数。\n证候分析：素体阴虚，经行时经血下行，营阴更虚，以致阴虚生内热，经期发热。\n辨证施治：滋阴养血清热。\n （3）血热型证候：经前或经行发热，口干喜饮，溲赤便秘，心烦易怒，经量增多，色鲜红。苔薄黄，舌质红，脉弦数。\n证候分析：阳盛体质，又嗜食辛热谷物，或肝郁化火，经行时冲脉之气旺盛，气火相迫，经行发热。\n辨证施治：清热凉血调经。\n （4）瘀热型证候：经前或经行发热，经量多而有血块，或量少而不畅，经色紫暗，下腹胀痛拒按。苔薄，舌紫或有瘀点，脉涩而数。 \n证候分析：原有子宫内膜异位症或慢性盆腔炎病史，宿瘀滞留胞中，积瘀化热，经行之际，血海充盈，瘀热郁结，气血营卫失调而致经行发热。\n辨证施治：活血化瘀除热。\n【临床症状】：\n每次月经来潮期间，或月经前后，出现发热症状者。多因经期感受外邪、阴虚生热、血虚挟滞或血热外泛等所致。本病与西医学的慢性盆腔炎、生殖器结核、子宫内膜异位症及临床症状不明显的感染有关。 \n【注意事项】：\n1.经行发热中药治疗预后较好，如伴慢性盆腔炎或子宫内膜异位者，经后需继续治疗，方能彻底治愈。\n2.经行发热由气虚或阴虚引起的，总由患者体质虚弱，经行脏腑气血或阴虚生内热所致，故经后应继续调养，并适当参加户外活动，增强体质，促进机体对经行期气血变化的适应性，可以防止经行发热。\n3.经行发热一般经后自然逐渐消退，如果病程日久，反复发病，甚至经后热度反而升高者，应根据其临床表现，作必要的检查，明确发热原因进行治疗。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class TongFengPage extends StatelessWidget {
  const TongFengPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('通风'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n痛风\n【别名】：\n高尿酸血症\n【疾病科别】：\n外科\n【病理辨证】：\n中医将本病归属“痹证”、“历节”等范畴。中医认为外邪侵袭、脾胃虚弱、饮食不节是主要病因。如感受湿热之邪，或寒湿之邪化热，闭阻经络关节而致病。脾胃虚弱，则运化失司，湿浊内生，日久化热，流注经脉为病。长期恣食膏粱厚味，损伤脾胃，脾虚生湿化热，湿热之邪痹阻脉络则为病。\n痛风在急性期治疗以祛邪为主，用清热利湿，祛风除湿等法；慢性期治疗以扶正祛邪为主，用补益肝肾，健脾益气等法。痛风中医辨证分型可以分为湿热痹阻、风寒湿痹、痰瘀阻滞、脾肾阳虚、肝肾阴虚5种：\n湿热痹阻型痛风证候：  症见关节红肿热痛，病势较急，局部灼热，得凉则舒。伴发热，口渴，心烦，小便短黄。舌质红，苔黄或腻，脉象滑数或弦数。\n证候分析：由于湿邪入里化热，或素体阳升，内有蕴热，湿热交蒸而致。\n辩证施治：治宜清热利湿，通络止痛。方选四妙白虎汤加减，药用苍术、黄柏、知母、生石膏、金银花、连翘、木瓜、地龙、薏苡仁、老鹳草、川牛膝、威灵仙等。\n风寒湿痹型痛风证候：  症见关节肿痛，屈伸不利，或见局部皮下结节、痛风石。伴关节喜温，肢体重着，麻木不仁，小便清长，大便溏薄。舌质淡红，苔薄白，脉象弦紧或濡缓。\n证候分析：由于正气不足，风寒湿邪乘虚侵入，阻滞经络，痹阻不通而致。\n辩证施治：治宜祛风散寒，除湿通络。方选桂枝乌头汤加减，药用桂枝、白芍、生姜、黄芪、制川乌、麻黄、防己、当归、川芎、羌活、苍术、防风等。\n痰瘀阻滞型痛风证候：  症见关节肿痛，反复发作，时轻时重，局部硬节，或见痛风石。伴关节畸形，屈伸不利，局部皮色暗红，体虚乏力，面色青暗。舌质绛红有瘀点，苔白或黄，脉象沉滑或细涩。\n证候分析：由于久病体弱，痹阻经络，气血不通，痰瘀交结于关节而致。\n辩证施治：治宜化痰散结，活血通络。方选二陈桃红饮加减，药用陈皮、半夏、茯苓、当归、川芎、赤芍、桃仁、红花、秦艽、炮山甲、天南星、伸筋草等。\n脾肾阳虚型痛风证候：  症见关节肿痛持续，肢体及面部浮肿。伴气短乏力，腰膝酸软，畏寒肢冷，纳呆呕恶，腹胀便溏。舌质淡胖，苔薄白，脉象沉缓或沉细。\n证候分析：由于素体阳虚，外邪侵入，迁延不愈，损伤脾肾而致。\n辩证施治：治宜健脾益肾，温阳散寒。方选附子理中汤加减，药用制附子、肉桂、白术、党参、茯苓、黄芪、杜仲、补骨脂、仙灵脾、肉苁蓉、骨碎补、金毛狗脊等。\n肝肾阴虚型痛风证候：  症见关节疼痛，反复发作，日久不愈，时轻时重，或关节变形，可见结节，屈伸不利。伴腰膝酸软，耳鸣口干，肌肤麻木不仁，神疲乏力，面色潮红。舌质干红，苔薄黄燥，脉弦细或细数。\n证候分析：由于久病伤津，阴液匮乏，不能滋养肝肾，邪居筋骨而致。\n辩证施治：治宜补肝益肾，祛风除湿。方选独活寄生汤加减，药用独活、桑寄生、白芍、熟地、杜仲、牛膝、龟版、鳖甲、菟丝子、女贞子、伸筋草等。 \n【临床症状】：\n痛风又称“高尿酸血症”，是一种因嘌呤代谢障碍，使尿酸累积而引起的疾病，属于关节炎的一种，又称代谢性关节炎。患者多于30～40岁以后发病，男性约占95％，女性多发生于绝经期后，但因特异酶缺陷者可在青少年发病。一般间歇性发作，主要表现为拇趾、踝及指关节等部位红肿，且伴随针刺、刀割般的锐性疼痛，多数患者会伴发高烧。痛风可以有“急性痛风”、和“间歇性痛风”。\n1．急性发作期的痛风病症状：发作时间通常是下半夜。该阶段的痛风症状表现为脚踝关节或脚指，手臂、手指关节处疼痛、肿胀、发红，伴有剧烈疼痛。使用显微镜观察，会发现患处组织内有松针状尿酸盐沉淀。就是尿酸盐沉淀引起的剧烈疼痛。请注意，发病期的血尿酸由于已经生成沉淀，所以尿酸值比平时最高值低。\n2．慢性期的痛风病症状：该阶段的痛风症状主要表现是存在痛风石，慢性关节炎、尿酸结石和痛风性肾炎及并发症。此时痛风频繁发作，身体部位开始出现痛风石，随着时间的延长痛风石逐步变大。\n【注意事项】：\n痛风病人除在医生指导下应用适当药物外，在日常生活中还应注意以下几点：\n1. 妥善处理诱发因素：禁用或少用影响尿酸排泄的药物：如青霉素、四环素、大剂量噻嗪类及氨苯喋啶等利尿剂、维生素B1和B2胰岛素及小剂量阿司匹林(每天小于2g)等。\n2. 注意体重、注意劳逸结合：\n（1）肥胖者要积极减肥，减轻体重，这对于防止痛风发生颇为重要。\n（2）注意劳逸结合，避免过劳、精神紧张、感染、手术，一般不主张痛风病人参加跑步等较强的体育锻炼，或进行长途步行旅游。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class ShiErZhiChangKuiYangPage extends StatelessWidget {
  const ShiErZhiChangKuiYangPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('十二指肠溃疡'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n十二指肠溃疡\n【别名】：\n消化性溃疡\n【疾病科别】：\n内科\n【病理辨证】：\n十二指肠溃疡，中医将本病归属“胃痛”、“嘈杂”、“吞酸”等范畴。认为脾胃虚弱，情志内伤，饮食不节是导致本病的主要原因。其中脾胃虚弱所致者，大多素体脾胃功能衰弱，运化失司，升降失调，使清阳不升，阴寒内聚；或胃中津液不足，郁热内生。情志内伤所致者，大多忧思恼怒，使肝郁气滞，疏泄失职，横逆犯胃；若气滞日久测血行不畅，血脉凝涩。饮食不节所致者，大多饮食过饱，胃纳太过；牌运不及，胃气失和；或饮食过少，生化无源，胃络失养；或恣食辛辣肥甘厚味，酷嗜烟酒，灼伤胃络，或贪食生冷不洁、寒积中院等。 临床上一般分为以下四型辨证施治：\n 1.肝气犯胃型：患者胃脘痛，牵及二胁，嗳气吐酸，急躁易怒，纳少，舌苔薄，脉细弦。\n 2.脾胃虚寒型：临床症见患者脘腹隐隐作痛，痛时喜温喜按，遇寒痛剧，乏力肢软，面色萎黄，大便溏，舌质淡，脉细弦。\n 3.胃阴不足型：患者胃痛隐隐，伴灼热感，口干舌糜，手足心热，不思食，舌红苔少，脉弦细。\n 4.湿热中阻型：症见患者胃脘疼痛，有灼热感，食则加剧，口子口苦，喜冷饮，嘈杂吞酸，大便多溏，小便黄，舌苔腻，脉细弦。\n【临床症状】：\n十二指肠溃疡的典型临床表现有上腹痛及上腹不适等，绝大部分人可出现各种消化不良的症状，但是有的也无任何症状，直至出现并发症。其常见的并发症主要有出血、穿孔。常见的胃肠道症状及全身症状主要有嗳气、反酸、上腹胀、胸骨后烧灼感、恶心、呕吐、纳差等。反酸及胸骨后烧灼感是由于贲门松弛，恶心、呕吐多反映溃疡可能提示溃疡处于活动期。部分患者有失眠、多汗等植物神经功能紊乱症状。\n【注意事项】：\n1.调整心态，注意休息，避免过度焦虑与劳累；\n2.戒烟戒酒，饮食规律，不宜过量；3.避免食用刺激性食物，如咖啡、浓茶、辣椒等；\n4.少食过甜及过酸的食物及水果，如巧克力、冰淇凌、苹果及桔子；\n5.少食易胀气的食物，如淀粉含量较高的红薯，藕，土豆等。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class ManXingWeiYanPage extends StatelessWidget {
  const ManXingWeiYanPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('慢性胃炎'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n慢性胃炎\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n中医将本病归属“胃院痛”、“胃痞”等范畴。认为脾胃素虚、饮食伤胃和肝气犯胃是引起本病的主要原因。若平素脾胃不健，中阳不运，精微不化，则致升降失司、气机阻滞。而嗜食辛辣，长期酗酒，过食生冷，暴饮暴食，均可损伤脾胃，造成脾胃不和、通降失司、气机壅塞。而忧思恼怒，气郁伤肝，肝失疏泄则横逆犯胃，导致气机阻滞、胃失和降。\n慢性胃炎是由多种原因引起的胃粘膜慢性炎症性病变。根据形态改变可分为浅表性胃炎、萎缩性胃炎和肥厚性胃炎，以部位又可分为胃体胃炎和胃窦炎。\n （1）湿热互结症状：胃脘疼痛灼热，院腹胀闷，泛恶，干呕，渴不欲饮，口苦口臭，尿黄，肠鸣漉漉，便溏或便秘。舌质红，边尖深红，苔黄腻，脉滑数。\n证候分析：湿热内结，气机不畅，故见胃脘疼痛灼热，脘腹胀问；胃气上逆测感泛恶，干呕；湿热内盛，津不上承，故有渴不欲饮，口苦口臭；湿热下注则尿黄；湿热伤及肠道，传化失常，故有肠鸣漉漉，便溏或便秘；舌质红，边尖深红，苔黄腻，脉滑数均为湿热内结之象。\n （2）肝胃气滞症状：胃脘疼痛，连及胁肋，胀闷不适，食后尤甚，嗳气嘈杂，呕恶泛酸。舌质淡红，苔薄白，脉弦。\n证候分析：肝失疏泄，气机不畅，则见胃院疼痛，连及胁肋；肝气横逆犯胃、胃失和降，可有胀问不适，食后尤甚，暖气嘈杂，呕恶泛酸；舌质淡红，苔薄白，脉弦为肝胃气滞之象。\n （3）脾胃虚寒症状：胃痛隐隐，喜暖喜按，食后胀满，呕吐清涎，纳食减少，腹泻便溏，四肢酸软，畏寒喜暖，面色不华。舌质淡红，苔薄白，脉细弱或沉细。\n证候分析：脾胃阳虚，脉络失于温养，故有胃脘隐痛；虚则喜按；寒则喜暖；脾虚运化迟缓，水饮停胃，故有食后胀满，呕吐清涎，纳食减少，腹泻便溏；脾主四肢，脾虚则四肢酸软；阳虚则生内寒，可有畏寒喜暖；面色不华，舌质淡红，苔薄白，脉细弱或沉细为中虚有寒，脾阳不振之征。\n （4）胃阴亏损症状：胃脘疼痛隐隐，似饥而不欲食，食后饱胀，干呕嗳气，口于舌燥，渴喜冷饮，便干。舌红少津有裂纹，脉细数。\n证候分析：胃阴受伤，胃络失养，故见胃脘疼痛隐隐，似饥而不欲食；胃失和降则食后饱胀，干呕嗳气；阴虚津少则口干舌燥，渴喜冷饮；肠道失润则便干；舌红少津有裂纹，脉细数均为阴虚之象。\n （5）瘀阻胃络症状：胃脘刺痛，痛有定处拒按，便血色黑。舌质黯红有瘀斑，脉细涩。\n证候分析：气滞则血瘀，血瘀有形，可有胃脘刺痛，痛有定处拒按；血脉受伤，可致便血色黑；舌质黯红有瘀斑，脉细涩均为瘀血内结之象。\n【临床症状】：\n由幽门螺杆菌引起的慢性胃炎多数患者无症状；有症状者表现为上腹痛或不适、上腹胀、早饱、嗳气、恶心等消化不良症状。有无这些症状及其严重程度与慢性胃炎的内镜所见和组织病理学改变并无肯定的相关性。自身免疫性胃炎患者还可伴有贫血表现。\n本病发生于各年龄段，十分常见，约占接受胃镜检查病人的80～90%，男性多于女性，随年龄增长发病率逐渐增高。\n【注意事项】：\n1、保持精神愉快：精神抑郁或过度紧张和疲劳，容易造成幽门括约肌功能紊乱，胆汁返流而发生慢性胃炎。\n2、戒烟忌酒。\n3、慎用、忌用对胃粘膜有损伤的药物。\n4、忌服浓茶、浓咖啡等有刺激性的饮料。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class ZhiQiGuanKuoZhangPage extends StatelessWidget {
  const ZhiQiGuanKuoZhangPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('支气管扩张'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n支气管扩张\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n中医学将本病归属于“咳嗽”、“肺痈”等范畴。认为感受外邪、饮食失节、情志不遂、劳倦过度、正气亏损等均可导致本病。如感受热邪，或风寒之邪化热，蕴结于肺，肺受热灼，失其清肃，热壅血瘀，蕴结成痈；或痰热素盛，饮食不节，嗜酒，过食辛热厚味，脾虚不运，使湿热内蕴，复感外邪，致内外合邪而发病；或六情不遂，肝气郁结，化火犯肺，灼伤肺络；或久病体虚，劳倦过度，损及肺脏，肺气不足而发病；或阴虚火旺，灼伤肺络而致病。\n支气管扩张的中医辨证分型可分为以下4种：  \n1.燥热伤肺症状：咳嗽吐痰，痰中带血或咯血，喉痒咽痛，口干鼻燥，或有身热。舌红苔，薄黄，脉浮数。\n证候分析：感受风热燥邪，损伤于肺，使肺失清肃，肺络受损，故咳嗽喉痒，痰中带血;燥热伤津，故口干鼻燥;舌红，苔薄黄，脉浮数为感受风热燥邪，燥热伤津之象。\n2.肝火犯肺症状：咳嗽阵作，痰中带血或咳吐纯血，血色鲜红，胸胁胀痛，烦躁易怒，口苦。舌质红，苔薄黄，脉弦数。\n证候分析：肝火上逆犯肺，使肺失清肃，肺络受损，故咳嗽咯血;肝之络布于胁肋，肝火偏亢，脉络壅滞，故胸胁胀痛;肝火上炎，故口苦，烦躁易怒;舌质红，苔薄黄，脉弦数为肝火偏亢之象。\n3.痰热壅肺症状：咳嗽，咯痰黄稠，或痰中带血，口苦口干，胸胁隐痛。舌红，苔黄腻，脉滑数。\n证候分析：邪热壅肺，灼津成疾，肺之肃降无权，故咳嗽，咯痰黄稠;肺络受损，则痰中带血;痰热郁蒸，故口苦口干;痰热壅肺，肺络不和，故胸胁隐痛;舌红，苔黄腻，脉滑数为痰热壅肺之象。\n4.阴虚肺热症状：咳嗽痰少，痰中带血或反复咯血，血色鲜红，口干咽燥，颧红，五心烦热，潮热盗汗。舌质红，少苔，脉细数。\n证候分析：阴虚肺热用市失清肃，故咳嗽疾少;\n【临床症状】：\n支气管扩张是指支气管及其周围肺组织的慢性炎症损坏管壁，以致支气管扩张和变形。多发于儿童和青年。流行性感冒、百日咳等都能诱发支气管和肺部的感染，损害支气管壁组织，削弱它的弹性.导致支气管扩张。本病能引起肺功能改变，使肺循环阻力增加，最后可并发肺源性心脏病。\n其典型症状为慢性咳嗽伴大量脓痰和反复咯血。\n慢性咳嗽伴大量脓性痰痰量与体位改变有关，如晨起或入夜卧床时咳嗽痰量增多，呼吸道感染急性发作时黄绿色脓痰明显增加，一日数百毫升，若有厌氧菌混合感染则有臭味。\n咯血可反复发生程度不等，从小量痰血至大量咯血，咯血量与病情严重程度有时不一致支气管扩张咯血后一般无明显中毒症状。\n若反复继发感染支气管引流不畅，痰不易咳出，可感到胸闷不适炎症扩展到病变周围的肺组织，出现高热、纳差盗汗、消瘦、贫血等症状。\n慢性重症支气管扩张的肺功能严重障碍时劳动力明显减退，稍活动即有气急、紫绀伴有杵状指（趾）。\n【注意事项】：\n1．预防受凉感冒。\n2．忌烟酒、辛辣\n3．避免情志刺激。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class ZhiQiGuanXiaoChuanPage extends StatelessWidget {
  const ZhiQiGuanXiaoChuanPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('支气管哮喘'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n支气管哮喘\n【别名】：\n哮喘\n【疾病科别】：\n内科\n【病理辨证】：\n支气管哮喘（简称哮喘）,中医学将本病归属于“哮证”范畴。认识到宿痰内伏是本病的重要环节，而形成宿痰内伏的原因是多方面的。如屡次外感风寒（或风热），肺失宣肃.上焦津液失布，凝聚为痰；或喜饮生冷，寒饮内停犯肺；\n也可偏食辛热肥甘或酸成食物，久之酿成痰饮，上犯于肺；或脾肾阳气不足，气不化津，致痰浊聚集于体内，上犯于肺；或本病日久，导致肺气不足，影响肾主摄纳的功能，从而肺肾俱虚。本病一旦发生，常痰随气升，气因痰阻，而出现痰气交阻、呼吸困难的征象。\n支气管哮喘中医辨证分型，可以分为以下几种：  \n1．冷哮型：证见呼吸急促，喉中有哮鸣声，痰白不粘或清稀多泡沫，胸脯满中如塞。面色晦暗带青，口不渴或渴喜热饮，天冷或受寒易发，形寒怕冷，舌淡苔白滑，脉弦滑或浮紧。   \n2．热哮型：多见于春末夏初或遇热而作，证见气粗息涌，喉中痰鸣如吼，胸脯满闷，呛咳阵作，痰黄稠厚，咯吐不利，烦躁不安，面赤自汗不寒恶，口渴喜饮。本病缓解期临床常见的证型有： \n3．肺气虚型：证见平素自汗，畏寒怕风，易感冒，常因气候变而发作，发作前喷嚏频作，鼻塞流清涕，气短声低，或喉中常有轻度哮鸣音，咳痰清稀色白，面色苍白，舌淡苔薄白，脉细弱或虚大。 \n4．肾虚型：证见平素气息短促，动则为甚，吸气不利，心慌，眩晕耳鸣，劳累后哮喘易发；若兼见畏寒肢冷，下肢浮肿，自汗，面色苍白，舌苔淡白，质胖嫩，脉沉细，则为肾阳不足；若兼见颧红，烦热，汗出粘手，舌质红少苔，脉细数，则为肾阴亏虚。 \n5．脾虚型：证见平素痰多，食少脘痞，便溏或食油腻而易于腹泻，常因饮食失当而诱发哮喘，倦怠乏力，气短不足以息，语言无力，舌质淡。苔薄腻或白滑，脉细弱。\n【临床症状】：\n哮喘患者的常见症状是发作性的喘息、气急、胸闷或咳嗽等症状，少数患者还可能以胸痛为主要表现，这些症状经常在患者接触烟雾、香水、油漆、灰尘、宠物、花粉等刺激性气体或变应原之后发作，夜间和（或）清晨症状也容易发生或加剧。很多患者在哮喘发作时自己可闻及喘鸣音。症状通常是发作性的，多数患者可自行缓解或经治疗缓解。\n很多哮喘患者在确诊之前常常经历很长时间的误诊过程，被诊断为慢性支气管炎、咽炎等，由于错误的诊断导致治疗方案的错误，不仅延误治疗，给患者造成身体上的痛苦，也给患者带来精神上、心理上的痛苦，经济上的付出也白白浪费掉。并且他们会经常使用抗生素，由于抗生素对哮喘病没有治疗作用，反复使用容易造成耐药。当然合并细菌感染时，抗生素会有效。\n【注意事项】：\n哮喘患者若出现严重急性发作，救治不及时时可能致命。哮喘反复发作可导致慢性阻塞性肺疾病、肺气肿、肺心病、心功能衰竭、呼吸衰竭等并发症。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class ZhiQiGuanYanPage extends StatelessWidget {
  const ZhiQiGuanYanPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('支气管炎'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n支气管炎\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n本病属中医学的“咳嗽”、“痰饮”、“咳喘”等范畴。认为外邪侵袭以及肺、脾、肾三脏功能失常，是引起本病的主要原因。人体正气不足，卫外失职，感受外邪，外邪既可以是风寒之邪，也可是风热之邪，也可风寒之邪化热，侵犯肺脏，使肺失宣肃；或肺气虚弱，卫外不固，复感外邪；或因年老体弱，脾肺气虚，脾失健运，湿聚成痰，停蓄于肺；或肺有宿疾，复感外邪；或久病之后，由脾肺损及肾，导致肾气不足，纳气无权等。 \n   中医支气管炎辨证分型可以分为以下几种：  （1）外感风寒型：\n此型较为多见，约80%的病人属此型。表现为咳嗽、多痰，痰液清稀、鼻塞流清涕，有时伴有怕冷发热、头痛身痛等症状，此型常用以下3个方剂治疗：\n （2）外感风热型：\n表现为咳嗽、痰少，痰液黏稠、咽喉肿痛、有时微感身热、头痛鼻塞等症状，常用以下两个方剂治疗。\n （3）外感燥热型：\n表现为干咳无痰，或痰中带血，有时伴有头疼发热、口渴等症状。\n【临床症状】：\n慢性支气管炎  \n《2011年支气管炎研究报告》指出慢性支气管炎临床上以长期顽固性咳嗽为特征。早晚气温较低或饮食刺激时，频频发咳。无并发症时，体温、脉搏无变化。病初呼吸无变化，以后由于支气管粘膜结缔组织增生变厚，支气管管腔变化狭窄，则发生呼吸困难。当并发肺气肿时，呼吸极度困难，这种呼吸困难的特征是呼吸性的或混合性的，并有肋间陷凹与出现息劳沟。胸部听诊，肺泡音增强，并发肺气肿时肺泡音减弱，常可听到干性罗音。胸部叩诊音高朗，肺界肥大。X线检查，肺部的支气管阴影增重而延长。\n临床研究发现：负氧离子能有效加强气管粘膜上皮的纤毛运动，影响上皮绒毛内呼吸酶的活性，改善肺泡的分泌功能及肺的通气和换气功能，从而具有缓解支气管痉挛、增加肺活量、调整呼吸频率、镇咳等功效。\n慢性支气管炎临床上可分为单纯型和喘息型两型。单纯型主要表现为咳嗽、咳痰；喘息型者除有咳嗽、咳痰外尚有喘息，伴有哮鸣音，喘鸣在阵咳时加剧，睡眠时明显。\n多缓慢起病，病程较长，反复急性发作而加重。主要症状有慢性咳嗽、咳痰、喘息。开始症状轻微，如吸烟、接触有害气体、过度劳累、气候变化或变冷感冒后，则引起急性发作或加重。或由上呼吸道感染迁延不愈，演变发展为慢性支气管炎。到夏天气候转暖时多可自然缓解。\n①咳嗽：支气管粘膜充血、水肿或分泌物积聚于支气管腔内均可引起咳嗽。咳嗽的严重程度视病情而定，一般晨间咳嗽较重，白天较轻，晚间睡前有阵咳或排痰。\n②咳痰：由于夜间睡眠后管腔内蓄积痰液，加以副交感神经相对兴奋，支气管分泌物增加，因此，起床后或体位变动引起刺激性排痰，常以清晨排痰较多，痰液一般为白色粘液或浆液泡沫性， 偶可带血。若有严重而反复咯血，提示有严重的肺部疾病，如肿瘤。急性发作伴有急性感染时，则变为粘液脓性，咳嗽和痰量亦随之增加。\n③喘息或气急：喘息性慢性支气管炎有支气管痉挛，可引起喘息，常伴有哮口罗音。早期无气急现象。反复发作数年，并发阻塞性肺气肿时，可伴有轻重程度不等的气急，先有劳动或活动后气喘，严重时动则喘甚，生活难以自理。\n总之，咳、痰、喘为慢性支气管炎的主要症状，并按其类型、病期及有无并发症，临床可有不同表现。\n按病情进展可分三期。\n（1）急性发作期：指在一周内出现脓性或粘液性痰，痰量明显增加，或伴有发热等炎症表现，或“咳”、“痰”、“喘”等症状任何一项明显加剧。\n（2）慢性迁延期：指有不同程度的“咳”、“痰”、“喘”症状迁延一个月以上者。\n（3）临床缓解期：经治疗或临床缓解，症状基本消失或偶有轻微咳嗽少量痰液，保持2个月以上者。\n早期可无任何异常体征。急性发作期可有散在的干、湿鸣音，多在肺部及肺底部，咳嗽后可减少或消失。哮鸣音的多寡或部位不一定。喘息型者可听到哮鸣音及呼气延长，而且不易完全消失。并发肺气肿时有肺气肿体征。\n急性支气管炎  \n《西安红缨医院哮喘科-2011年支气管炎研究报告》指出急性支气管炎主要症状是咳嗽，病初，为短、干性痛咳。3~4天后，随着渗出物的增加，则变为湿、长咳，痛感减轻。咳嗽之后常伴发呕吐。两侧鼻孔流浆液、浆液粘性或粘液脓性鼻液，当咳嗽时，流出量增多。胸部听诊，病初肺泡音增强，2~3天后由于支气管粘膜肿胀和分泌粘稠的渗出物，可听到干性罗音，当支气管内多量稀薄的渗出物时，听到湿性罗音，并以大、中水泡音较多。胸部叩诊，一般无变化。全身症状轻微，体温正常或升高0．5~1℃，呼吸增粗。病发于传染病的支气管炎常发高热，且有重剧的全身症状。细支气管炎全身症状重剧，体温升高1~2℃，呼吸增速，呈呼气性呼吸困难，常张口呼吸，可视粘膜发绀。由始至终均发生微弱的短痛咳。通常无鼻液，或仅见少量鼻液。胸部听诊有小水泡音或干性罗音。在细支气管完全阻塞，渗出物向肺泡侵入，将引起支气管炎。胸部叩诊，呈高朗的清音，肺界多后移，这是由于支气管狭窄，呼吸困难，发生急性肺气肿的结果。如并发支气管肺炎，则有岛屿状浊音。\n腐败性支气管炎  \n除全身症状重剧外，呼出气体具有恶臭味，并流污秽不洁及带有腐败臭味鼻液。\n【注意事项】：\n1、戒烟：慢性支气管炎患者不但要首先戒烟，而且还要避免被动吸烟，因为烟中的化学物质如焦油、尼古丁、氰氢酸等，可作用于植物神经，引起支气管的痉挛，从而增加呼吸道阻力；另外，还可损伤支气管粘膜上皮细胞及其纤毛，使支气管粘膜分泌物增多，降低肺的净化功能，易引起病原菌在肺及支气管内的繁殖，致慢性支气管炎的发生。\n2、注意保暖 在气候变冷的季节,患者要注意保暖，避免受凉，因为寒冷一方面可降低支气管的防御功能，另一方面可反射地引起支气管平滑肌收缩、粘膜血液循环障碍和分泌物排出受阻，可发生继发性感染。\n3、加强锻炼：慢性支气管炎患者在缓解期要作适当的体育锻炼，以提高机体的免疫能力和心、肺的贮备能力。\n4、预防感冒：注意个人保护，预防感冒发生，有条件者可做耐寒锻炼以预防感冒。\n5、做好环境保护：避免烟雾、粉尘和刺激性气体对呼吸道的影响，以免诱发慢性支气管炎。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class BaiXueBingPage extends StatelessWidget {
  const BaiXueBingPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('白血病'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n白血病\n【别名】：\n血癌\n【疾病科别】：\n内科\n【病理辨证】：\n中医学认为白血病的发病原因有“因虚致病”和“因病致虚”两种观点，前者认为本病先有体虚内伤，然后邪气凑之；而后者认为先有邪毒内伏，然后导致正虚邪盛。中医学上认为白血病属于“急劳”的范畴。患者多为温热毒邪侵袭，伤营动血，侵及骨髓导致阴伤血耗而发病。同时，该病还与劳倦、饥饱、七情等因素有关。白血病的中医辩证分型有以下几种：\n急性白血病：  \n（1）气阴两虚症状：神疲乏力，低热，五心烦热，自汗盗汗，衄血或紫斑，时隐时现，面色不华。舌嫩红，苔薄白，脉细数无力。多见于贫血为主的急性白血病。\n证候分析：体弱久病或饮食失调而致元气不足，脏腑虚衰，故神疲乏力，面色不华；气虚表卫不固，则自汗；气虚不能统摄，血因之而外溢，或见衄血，或紫斑时隐时现；虚火内扰，可见低热，五心烦热，盗汗等；舌嫩红，苔薄白，脉细数无力，为气阴两虚之征。\n辨证施治：益气养阴，泻火解毒。\n（2）热毒炽盛症状：起病急，壮热口渴，骨节疼痛，肌肤灼热，周身出现瘀点，时有肌衄，鼻衄，齿衄，小便黄赤，大便秘结。舌苔垢腻，脉滑数。多见于以发热为主的白血病。\n证候分析：正气不足，毒邪易侵，热毒由表入里，伤及营阴，营血热炽，故起病急，壮热口渴，肌肤灼热；阴精受损，内热熏蒸，热伤血络，迫血妄行，故见周身瘀点，肌衄，鼻衄，齿衄；累及于肾，而肾主骨，故有关节疼痛；；小便黄赤，大便秘结，舌苔垢腻，脉滑数均为热毒炽盛之象。\n辨证施治：清热解毒，凉血泻火。\n（3）痰瘀阻结症状：身微热，面色不华，神疲乏力，颌下、颈部、腋窝痰核，不红不痛，或腹内疤积，骨节疼痛。舌淡紫，苔薄，脉弦滑或弦数。多见于急性淋巴细胞性白血病。\n证候分析：精气内虚，毒邪乘虚而入，耗伤气阴，故见身微热，神疲乏力，面色不华；病程稍久，气血亏虚汽滞血瘀，脉络阻塞，结于胁下，形成疤块，留于肢节，可见骨节疼痛；气不化津，聚液成痰，与瘀血交阻，而见颌下、颈部、腋窝痰核；舌淡紫，苔薄，脉弦滑为痰瘀互结之征。\n辨证施治：清热行瘀，消痰散结。\n慢性白血病：  \n（1）气阴两虚症状：面色少华，倦怠乏力，眩晕心悸，五心烦热，胁下痞块疼痛，腰膝酸软，自汗盗汗，午后潮热，脉细数。苔薄白，舌嫩红体胖。多见于慢性白血病活动期有贫血表现者。\n证候分析：气虚血亏，失于儒养，脑失所养则眩晕，心失所养则心悸，四肢百骸失养则倦怠乏力，腰膝酸软；气血不能上荣于面测面色少华；气虚表卫不固则自汗；阴虚而虚火内扰则盗汗，午后期热，五心烦热；气虚不能化津，痰瘀互阻，积于胁下，则胁下痞块疼痛；舌嫩红体胖，苔薄白，脉细数乃气阴两虚之征。\n辨证施治：益气养阴清热。\n（2）气滞血瘀症状：腹胀，胁下疤块明显，或肢体肿块作痛，胸胁胀痛，低热起伏，自汗盗汗，面色晦黯，纳减乏力。舌质淡紫，有瘀斑，脉弦。多见于慢性白血病活动期，复发期。\n证候分析：气滞血阻，脉络不和，积而成块，故胁下疤块明显，胀痛并见，或肢体肿块作痛；气血凝结，营卫不和，故低热起伏，自汗盗汗；气滞血瘀，脾胃失调，故纳减乏力；面色晦黯，舌淡紫，有瘀斑，脉弦，为病在血分，气滞血瘀之象。\n辨证施治：清肝理气化瘀。\n（3）正虚瘀结症状：面色萎黄，乏力低热，自汗盗汗，骨痛身痛，左胁下疤块肿大坚硬（脾肿大），体表痰核日益增大，形体瘦削，纳减，或衄血。舌淡紫有瘀斑，或香红光滑，脉细弱或弦细。多见于白血病终末期。\n证候分析：正虚血瘀日久，新血不生，营气大亏，故面色萎黄，乏力；营卫失和，则自汗盗汗，低热；积块日久，血络瘀结，故左胁下疤块肿大坚硬，痰核日益增大；血不循经，故衄血；中气不足，运化无权，故纳减，形体瘦削；舌质淡紫有瘀斑域舌红光滑，脉细弱或弦细，均为气血耗伤，津液枯竭，瘀血气机不利之象。\n辨证施治：益气养血散结。\n【临床症状】：\n因为慢性粒细胞白血病进展比较缓慢，所以很多病人没有症状，尤其在早期的病人，随着疾病的进展，白血病破坏骨髓正常造血功能，浸润器官，引起了明显但非特异的症状。包含有：\n1.贫血：表现为乏力、头晕、面色苍白或活动后气促等；\n2.反复感染且不易治好：主要由于缺少正常的白细胞，尤其是中性粒细胞；\n3.出血倾向：容易出血、出血不止、牙龈出血、大便出血及月经不规则出血等，由于血小板减少引起；\n4.脾大、不明原因的消瘦及盗汗等。\n【注意事项】：\n1.应当及早明确诊断，对症治疗，以免延误病情，危及生命。\n2.精神疗法是本病的一个重要疗法，使患者克服悲观情绪，配合治疗。\n3.注意休息，化疗期间应卧床。\n4.注意口腔、皮肤、肛周及外阴卫生，预防感染。\n5.饮食应富于营养，易于消化，多食蔬菜及富含维生素食物。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class DaYeXingFeiYanPage extends StatelessWidget {
  const DaYeXingFeiYanPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('大叶性肺炎'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n大叶性肺炎\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n中医学将“大叶性肺炎”归属于“喘咳”、“肺胀”、“风温”等范畴。认为本病多在正气不足，卫外功能减弱的情况下，感受外邪所引起的。如清代医家叶桂曾指出“温邪上受，首先犯肺”。即风温等外邪侵袭人体，涉及肺脏，产生一系列病理变化。外邪既可以是风热之邪，也可以是风寒之邪，初起侵犯肺卫，使肺失宣肃而产生疾病，也可热邪蕴结于肺，或痰湿停留于肺。本病在发展过程中，一般经邪正斗争的交争，往往正能胜邪，后期可出现气阴两伤的证情。若正不胜邪则可形成阳气欲脱的危重证候。\n大叶性肺炎是由细菌、病毒等引起的肺实质的急性炎症。四季均可发病，而冬、春两季多见。发病年龄以青壮年居多，其中金黄色葡萄球菌肺炎以幼儿为多见。本病的发生与人体抵抗力的强弱有关。本病若不积极治疗，可产生严重的并发症。\n【临床症状】：\n1.起病急骤，寒战、高热、胸痛、咳嗽、咳铁锈色痰。病变广泛者可伴气促和紫绀。\n2.部分病例有恶心、呕吐、腹胀、腹泻。\n3.重症者可有神经精神症状，如烦躁不安、谵妄等。亦可发生周围回圈衰竭，并发感染性休克，称休克型(或中毒性)肺炎。\n4.急性病容，呼吸急促，鼻翼扇动。部分患者口唇和鼻周有固有疱疹。 5.充血期肺部体征局部呼吸动度减弱，语音震颤稍增强，叩诊浊音，可听及捻发音。\n实变期可有典型体征，如患侧呼吸运动减弱，语音共振、语颤增强，叩诊浊音或实音，听诊病理性支气管呼吸音。消散期叩诊逐渐变为清音，支气管呼吸音也逐渐减弱代之以湿性啰音。\n【注意事项】：\n(1)注意预防上呼吸道感染加强耐寒锻炼;\n(2)避免淋雨受寒醉酒过劳等诱因;\n(3)积极治疗原发病如慢性心肺疾病、慢性肝炎、糖尿病和口腔疾病等可以预防大叶性肺炎。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class JieChangYanPage extends StatelessWidget {
  const JieChangYanPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('结肠炎'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n结肠炎\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n本病病位在肠，与肝、脾、胃、肠等脏腑有关。初起多因情志不畅，肝气郁结，犯及脾胃；或因饮食不节，过食肥甘，或因湿热之体复饮食生冷以致脾胃损伤，导致脾失健运，清浊不分；或因感受暑湿热毒之邪，从而湿热毒邪内蕴，下迫肠道，气血凝滞，壅而化脓；出血日久，亦必耗血伤阴。久病人络，可致瘀血内阻；病久脾肾阳虚，清阳不升而中气下陷，温运无力而胃关不固。 \n（l）.脾虚湿热症状：腹泻，次数不等，里急后重，或肛门灼热，粪便中挟黏液脓血样便，味腥臭，腹痛，小便短赤，乏力消瘦，发热，口苦纳呆。舌苔黄腻，脉细滑数。\n证候分析：脾虚生湿，郁而发热，伤及肠道，传化失常，则有腹泻，次数不等；湿热熏蒸肠道，脉络受伤，气血瘀滞，化为脓血，故粪便中挟黏液脓血样便，味腥臭；湿热之邪壅滞肠中，气机不畅，则有腹痛、里急后重；湿热下注坝u肛门灼热＊＼便短赤；脾气虚弱，可见神疲乏力、纳呆消瘦；发热口苦、舌苔黄腻均为湿热内蕴之象；脾虚则脉细；脉滑数乃湿热之脉象。\n辩证施治：清热解毒，化湿消滞。\n（2）.肝旺脾弱症状：腹痛即泻，泻后痛减，常因抑郁恼怒、情绪紧张或激动而发作，大便夹脓血，胸胁胀满，烦躁易怒，暖气纳呆，肠呜腹胀，头痛时作。舌淡红，脉弦细。\n证候分析：七情所伤，肝失条达，气机不畅，横逆犯脾，健运失司，导致腹痛即泻，泻后痛减，每因情志不调而作汽滞血阻，壅而化脓，可有大便夹脓血；\n肝旺则胸胁胀满、烦躁易怒、头痛时作；气滞则嗳气、肠鸣腹胀；脾虚则纳呆舌淡红，脉弦细是为肝旺脾虚之征。\n辩证施治：抑肝扶脾，止泻止痛。\n（3）.瘀阻肠道症状：腹部刺痛，按之痛甚，大便中常夹脓血或紫黑色血块，面色晦黯。舌黯红，有紫斑，脉细弦。\n证候分析：瘀阻肠道，气机不畅，故有少腹刺痛，按之痛甚；气滞血瘀，壅而化脓，故大便中常夹脓血或紫黑色血块；面色晦黯、舌黯红、有紫斑、脉细弦是为气滞血瘀之象。\n辩证施治：理气活血，逐瘀止泻。\n（4）.脾胃虚弱症状：大便搪薄，可挟有黏液，或混有大量肠垢、脓血，甚则泄泻不止，饮食不当即有发作，乏力倦怠，食欲不振，面色?s白。舌淡苔白，脉濡细。\n证候分析：脾胃虚弱，运化无权，水谷不化，清浊不分，故大便溏薄，或挟有黏液，或混有大量肠垢。脓血，甚则泄泻不止，饮食不当即有发作；脾胃虚弱，生化乏源，气血两亏，可见乏力倦怠、食欲不振、面色?s白；舌淡苔白，脉儒细为脾胃虚弱之征。\n辩证施治：益气升阳，健脾止泻。\n（5）.阴虚内热症状：腹泻时作，腹中隐痛，便血鲜红黏稠，常伴有午后潮热，盗汗，心烦不寐。舌红少苦，脉细数。\n证候分析：久泻不愈，伤及阴血，可有腹泻时作，腹中隐痛，便血鲜红黏稠；阴虚生内热，故有午后潮热，盗汗；虚热扰动心神，则心烦不寐；舌红少苦，脉细数是为阴虚内热之象。\n辩证施治：滋养阴血，清热止泻。\n（6）.脾肾阳虚症状：黎明之前，肠鸣腹痛腹泻，泻后则安，大便为黏液血样，遇寒即发，形寒肢冷，口淡纳少，喜热饮，腰酸乏力，面色苍白。舌淡苔白，脉沉细无力。\n证候分析：泄泻日久，肾阳虚衰，不能温运脾阳，运化失常，黎明之前阳气未振，阴寒较盛，故有黎明之前腹痛腹泻，又称为“五更泻”；泻后腑气通利，故泻后则安；阴寒凝滞，气血凝聚，伤及肠络，则大便为黏液血样；阳虚生内寒，可见遇寒即发，形寒肢冷；肾阳不足，则腰酸乏力；脾阳虚亏测口淡纳少，喜热饮；面色苍白；舌淡苔白，脉沉细无力均为脾肾阳虚之象。 \n辩证施治：温补脾肾，涩肠止泻。\n【临床症状】：\n常见症状：有腹泻、鲜血便、黏液样血便、脓血便、里急后重、腹痛、发热、纳呆、消瘦、贫血等。\n（1）腹泻：腹泻是结肠炎早期的主要症状。常反复发作，多因饮食不当、情绪激动、过度疲劳诱发。\n（2）腹痛：轻度病人无腹痛或仅有腹部不适。一般有轻度至中度腹痛，系左下腹阵痛，可涉及全腹。有一便后缓解的规律。\n（3）便秘：大便秘结4—5日排便一次，粪便如羊屎样，甚者不吃泻药不能通便。\n（4） 其他症状：腹胀、消瘦、乏力、肠鸣、失眠、多梦、怕冷，严重者有可发热，心跳加速，以及衰弱，贫血，失水，电解质平衡失调和营养障碍等表现。\n【注意事项】：\n一、不宜吃生冷、油腻、辛辣刺激性食物及吸烟喝酒。生冷食物指生冷瓜果、冷饮、凉馍、冷菜冷饭；油腻食物指肥肉、油炸煎炙的食品 ;辛辣刺激性食物如辣椒、生葱、生姜、生蒜、韭菜、洋葱等食品。进食这些食物及吸烟喝酒刺激结肠壁，使肠壁水肿、充血、平滑肌痉挛,引起本病复发或加重本病。\n二、不宜吃过敏性食物由于人的体质不同，对食物的过敏性感受也不同。牛奶、鸡蛋、蜂蛹、土蚕、未成熟番茄、花生、波萝、蚂蚱、蟹类、蚕豆、蛇肉及一些昆虫食品等都具有致敏作用 ,有些人吃了这些食物易引起过敏、可有些人就不过敏，对某一食物某人是否过敏，就主要在于各人的体质不同而异。\n三、不宜吃得过饱暴饮暴食吃得过饱，使肠胃功能紊乱使本病复发或加重。\n四、腹部不宜受凉即使是夏天天气再热，也要把腹部盖好，不要使腹部着凉，否则肠子遇冷刺激而痉挛引起本病发作或加重。\n五、不宜过度劳累 在过度劳累情况下，人体免疫功能和抗病能力下降，容易使本病发作或加重。\n六、不宜长期生气、郁闷、恼怒、忧思：因为这些不良的精神刺激，可使迷走神经过度兴奋，刺激肠蠕动增强，肠液分泌过剩，使肠黏屏障的保护性能下降而造成肠黏膜化脓和出血，形成溃疡性结肠黏膜炎。',style: TextStyle(
              fontSize: 16,
            ),
            ),
          ],
        ),
      ),
    );
  }
}
class GanYingHuaPage extends StatelessWidget {
  const GanYingHuaPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('肝硬化'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n肝硬化\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n中医将本病归属“积聚”、“臌胀”等范畴。认为本病常由黄疸日久、感染蛊毒、饮食不节、嗜酒过度等原因，引起湿热内郁，肝脾内伤。肝损则气滞，日久必致血瘀，脾伤则湿停，日久必致肾亏，最终形成肝脾肾三脏受损，气滞血瘀，水湿内聚，本虚标实，虚实夹杂之证。\n肝硬化的中医病理病机可分为：肝气郁结、脾虚湿盛、湿热内蕴、肝肾阴虚、脾肾阳虚、血瘀、水湿内停等种类。\n （1）肝气郁结：长期情志失调，致肝气郁结，胁肋为肝经为主，故见胁肋胀痛或窜痛。肝郁化火，可有急躁易怒、口苦。肝气横逆犯脾，致肝脾不调、脾胃不和，而有纳呆、嗳气、腹胀等症。\n（2）脾虚湿盛：饮食不节，过食肥甘厚味，或思虑劳倦过度，损伤脾胃致脾虚、运化失司、水湿内停，而有纳呆、腹胀、乏力、呕恶、便溏及面色萎黄等症。\n（3）湿热内蕴：饮食不节，过食烟酒辛辣炙烤之品，损伤脾胃，水湿内停，郁而化热。或外感湿热毒邪，侵害肝胆，殃及脾胃，导致湿热中阻，而见皮目黄染色鲜明，伴纳呆、呕恶、口臭、腹胀、尿黄、便黏不爽、胁胀灼痛等症。\n（4）肝肾阴虚：病久不愈，损伤肝肾，或攻伐太过，耗伤津液，而致肝肾阴虚，阴虚火旺。症见腰酸腿软、双目干涩、头晕耳鸣、五心烦热、胁肋隐痛、遇劳加重，大便干，尿短赤等。\n（5）脾肾阳虚：寒湿之邪、苦寒之药损伤脾阳，日久及肾，致脾肾阳虚，脾肾失于温煦，在脾肾气虚的基础上而伴形寒肢冷五更泄泻等症。\n（6）血瘀：气滞痰阻，经脉不通，或气虚无力推动血脉运行，或跌扑损伤致瘀血不散，日久而致血瘀。症见胁痛如刺，痛处不移，朱砂掌、蜘蛛痣、腹壁青筋暴露，胁下痞块等。\n（7）水湿内停：上述各种病因导致水湿不化，停于中焦，而见腹大胀满或坚，中医名曰“水臌”。\n【临床症状】：\n中医将本病归属“疤积”、“臌胀”等范畴。认为本病常由黄疸日久、感染蛊毒、饮食不节、嗜酒过度等原因，引起湿热内郁，肝脾内伤。肝损则气滞，日久必致血瘀，脾伤则湿停，日久必致肾亏，最终形成肝脾肾三脏受损，气滞血瘀，水湿内聚，本虚标实，虚实夹杂之证。 \n 症状：食欲不振，恶心，上腹胀满，乏力，腹泻，腹痛（上腹部多见），出血（牙龈、鼻腔、皮肤、黏膜等处，女性常有月经过多），嗜睡，兴奋或木僵等症。\n【注意事项】：\n（1）病室宜安静通风。\n（2）肝脏与精神情志的关系非常密切。情绪不佳，精神抑郁，暴怒激动均可影响肝的机能，加速病变的发展。树立坚强意志，心情开朗，振作精神，消除思想负担，会有益于病情改善。肝硬化代偿功能减退，并发腹水或感染时应绝对卧床休息。在代偿功能充沛、病情稳定期可做些轻松工作或适当活动，进行有益的体育锻炼，活动量以不感觉到疲劳为度。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class GanmaoPage extends StatelessWidget {
  const GanmaoPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('感冒'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n感冒\n【别名】：\n伤风\n【疾病科别】：\n内科\n【病理辨证】：\n感冒的病因为六淫、时行病毒侵袭人体而致病，以风邪为主因。但在不同季节，往往与其他当令之时气相会而伤人，如冬季多属风寒，春季多属风热，夏季多夹暑湿，秋季多兼燥气，梅雨季节多夹湿邪。若四时六气失常，非时之气夹时行病毒伤人，则更易引起发病，且不限于季节性，病情多重，往往互为传染流行。感冒，为常见病、多发病，四时皆有。虽属表证。病邪轻浅，但治不及时或治不恰当，致邪气深入，常累及肺脏或诱发宿疾，甚或引起心、肾病证。中医将感冒分为风寒型感冒、风热型感冒、暑湿型感冒和时行感冒（流行性感冒）四种类型。\n病理变化为正气不足，卫外功能减弱，肺卫调节疏懈，六淫之邪夹杂病毒乘袭，邪毒由口鼻、皮毛入侵，肺卫首当其冲，迅速出现卫表不和及肺失宣肃的证候；或因生活起居不当，寒温失调，以及过度劳累，而致肌腠不密，外邪侵袭为病；若体质虚弱，卫外不固，稍不谨慎，吹风受凉之后，则可见虚体感邪。其他如肺经素有痰热、伏火，或痰湿内蕴，肺卫失于调节，则每易感受外邪。又因四时六气不同以及人体素质的差异，故证候表现上有风寒、风热和暑湿兼夹之证，以及素体阳虚者易受风寒，阴虚者易受风热、燥热，痰湿偏重者易受外湿。\n1.风寒证：  \n证候分析：风寒之邪外束肌表，卫阳被遏，故见恶寒，发热，无汗；清阳不展，络脉失和，则头痛，肢节酸痛；风寒上受，肺气不宣而致鼻塞流涕，咽痒咳嗽；寒为阴邪，故口不渴或渴喜热饮；舌苔薄白而润，脉浮紧，俱为表寒征象。\n临床症状：恶寒重，发热轻，无汗，头痛，肢节酸痛，鼻塞声重，时流清涕，喉痒，咳嗽，咯痰稀薄色白，口不渴或渴喜热饮。舌苔薄白而润，脉浮或紧。\n治疗原则：辛温解表。\n2.风热证：  \n征候分析：风热犯表，热郁肌腠，卫表失和，故见身热微恶风，汗出不畅；风热上扰则头胀痛；风热之邪熏蒸清道，故咽喉肿痛，咽燥口渴，鼻流浊涕；风热犯肺，肺失清肃，则咳嗽，痰黏或黄；苔薄白微黄，舌边尖红，脉浮数，为风热侵于肺卫之征。\n临床症状：身热较著，微恶风，汗泄不畅，头胀痛，咳嗽，痰黏或黄，咽燥，或咽喉乳蛾红肿疼痛，鼻塞，流黄浊涕，口渴欲饮。舌苔薄白徽黄，边尖红，脉浮数。\n治疗原则：辛凉解表。\n3.暑湿证：  \n证候分析：夏季感冒，感受当令之暑邪，暑多挟湿，每多暑湿并重，暑湿伤表，表卫不和，故身热，微恶风，汗少，肢体酸痛；风暑夹湿，上犯清空，则头昏重胀痛；暑热犯肺，肺气不清，故咳嗽痰黏，鼻流浊涕；暑热内扰，热灼津液，则心烦，口渴，小便短赤；湿热中阻，气机不展，故胸闷，泛恶，口中黏腻，渴不多饮；舌苔薄黄腻，脉儒数为暑热挟湿之征。\n临床症状：身热，微恶风，汗少，肢体酸重或疼痛，头昏重胀痛，咳嗽痰黏，鼻流浊涕，心烦口渴，或口中黏腻，渴不多饮，胸闷，泛恶，小便短赤。舌苔薄黄而腻，脉濡数。\n治疗原则：清暑祛湿解表。\n【临床症状】：\n临床常以发热、鼻塞、流涕、喷嚏、咳嗽、头痛、全身不适等为主要特征。本病可发生于任何年龄，四季均可发病，尤以冬春为多见。根据发病情况，可分为流行性感冒和普通感冒两类：前者起病急骤，具有较强的传染性，常可引起广泛流行；后者相对起病慢，无传染性和流行性。普通感冒预后良好，流行性感冒如不及时治疗，可变生他病，如病毒性心肌炎等。流行性感冒属中医的“时行感冒”范畴，普通感冒属中医的“伤风”、“感冒”范畴。\n【注意事项】：\n风寒感冒的其他治疗方法：包括桑拿、用热水泡脚（最好加点酒）、盖上两层被子、喝姜糖水、喝姜粥等等。\n对于感冒，预防最重要，加强体育锻炼、增强体质是抵抗感冒的重要手段。同时也应养成良好的个人卫生习惯和合理的饮食习惯，防患于未然。\n1.感冒只要能及时而恰当的处理，即可较快痊愈。但对老年、婴幼儿、体弱患者，必须加以重视，注意防止发生传变，或同时夹杂其他疾病。\n2.注意避风保暖，以防复感。\n3.多饮开水，适当休息。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class HighBloodPressurePage extends StatelessWidget {
  const HighBloodPressurePage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('高血压'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n高血压\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n在静息状态下动脉舒张压和/或收缩压增高的临床病况称之为高血压。高血压是一种以动脉压升高为特征，可伴有血管、心脏、脑和肾脏等器官功能性或器质性改变的全身性疾病，高血压病有原发性高血压和继发性高血压之分。高血压发病的原因很多，发病因素可以分为环境和遗传两个方面。 \n中医将本病归属“眩晕”、“头痛”范畴，认为情志失调，饮食不节，内伤虚损是导致本病的主要病因。如长期精神紧张或恼怒忧思，可致肝气郁滞，日久则郁而化火；劳累过度或年老体弱，使肾阴虚损，肝失所养，阴不敛阳则肝阳偏亢，上扰清窍；恣食肥甘或嗜酒过度，可损伤脾胃，致脾失健运，湿浊壅遏，久壅化火。凡此，都使肝阳亢奋于上，阴血亏损于下，形成上实下虚之象。\n中医学认为，高血压病是由于机体阴阳平衡失调产生的结果。阴虚为本，阳亢为标，病变与五脏有关，最主要涉及心、肝、肾，在标为肝，在本为肾，临床表现以肝肾阴虚或肝阳上亢为主要症状，以阴损于前，阳亢于后为主要特点，到了病程后期，发展为阴阳两虚。所以在人体五脏六腑在脚上都有相应的投影，脚部是足三阴经的起始点，又是足三阳经的终止点，踝关节以下就有六十多个穴位。调理脏腑功能，恢复阴阳平衡，是中医中药治疗高血压的基本原则。\n【临床症状】：\n高血压的特征为在静息状态下动脉压（舒张压和/或收缩压）的升高，可伴有血管、心脏、脑和肾脏等器官功能性或器质性改变的全身性疾病，高血压的常见并发症有冠心病、慢性肾功能衰竭、高血压心脏病、高血压脑病、脑血管病，以及其他高血压危象。临床的表现为以下几点：\n1、眩晕：女性患者出现较多，可能会在突然蹲下或起立时有所感觉。\n2、头疼：部位多在后脑，并伴有恶心、呕吐等症状。若经常感到头痛，而且很剧烈，同时又恶心作呕，就可能是向恶性高血压转化的信号。\n3、心悸气短：高血压会导致心肌肥厚、心脏扩大、心肌梗死、心功能不全。这些都是导致心悸气短的症状。\n4、耳鸣：双耳耳鸣，持续时间较长。\n5、失眠：多为入睡困难、早醒、睡眠不踏实、易做噩梦、易惊醒。这与大脑皮质功能紊乱及自主神经功能失调有关。\n6、肢体麻木：常见手指、脚趾麻木或皮肤如蚁行感，手指不灵活。身体其他部位也可能出现麻木，还可能感觉异常，甚至半身不遂。\n【注意事项】：\n1、不要盲目降压。首先弄清是否因肾脏疾病、嗜铬细胞瘤、皮质醇增多症、妊娠中毒症、大动脉疾病等引起的高血压。须找出病因 ，对症治疗。\n2、用药剂量和种类不能雷同。应按病情轻重分级治疗 ，并注意个体差异 ，药量因人而异。\n3、除轻型或刚出现的高血压外 ，用药尽量不要单一 ，应联合用药 ，复方治疗。优点是产生协同作用 ，减少每种药物剂量及其副作用。\n4、坚持长期合理服药 ，勤测血压 ，及时调整剂量 ，巩固疗效。\n5、宜逐渐降压。对无并发症的患者 ，要求使血压降至 140/9 0毫米汞柱左右。过度降压可使脑、心、肾供血不足导致进一步缺血，轻者头晕 ，重者导致缺血性脑中风和心肌梗塞。\n6、合理服用降压药 ，不宜骤然停药 ，以免引起血压升高。\n7、防止情绪激动 ，保证睡眠充足 ，心情舒畅。\n8、宜晨起即服降压药，忌睡眠前服降压药。\n9、宜每天坚持温水浴（摄氏40℃），浴室温度也不能太低。\n10、多饮矿泉水、冰化水（结冰后融化的水）。\n11、减少房事，缩短房事时间，40岁以上更宜节制。\n12、保持大便畅通，排便时勿要用力屏气。\n13、工作环境和居住房间的色调最好是绿色、蓝色等冷色调，它能使情绪安稳不易发生冲动。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
class ZhichangyanPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('直肠炎'),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              '【疾病名称】：\n直肠炎\n【别名】：\n暂无\n【疾病科别】：\n内科\n【病理辨证】：\n直肠炎是多发的肠道疾病，常见的直肠炎有：急性直肠炎、慢性直肠炎、结核性直肠炎、放射性直肠炎。急性直肠炎长期不愈，则变为慢性直肠炎。直肠炎常见于体质虚弱抵抗力低下，心、肺、肝、胃肠道疾病、呼吸道感染、传染病后，大便秘结、腹泻、痔，肛管直肠脱垂，肛瘘、息肉病、肛门直肠狭窄、直肠恶变、直肠损伤、异物等，都可使直肠发炎。另外一些因素如饮食不慎如过度饮酒、过食刺激性强的食物等，不适当的长期服用泻药，肛门内腐蚀性药物过多，细菌感染均可引起直肠炎。\n中医学认为，直肠炎与“脾胃虚弱”、“湿热内瘟”、“饮食停滞”和“虫积湿滞”有关。中医学认为直肠炎大多为脾肾阳虚、气滞血瘀、气血两虚、湿热壅结、劳累过度、饮食失调、精神因素而诱发。直肠炎常见的可以分为便秘型、腹泻型和腹泻便秘交替型。\n1．便秘型：大便秘结，如羊屎样，排便不畅、不尽，甚则数日内不能通大便，有一部分患者原有长期腹泻史，伴有腹痛、消瘦、口干、腹胀贫血等症，易恶变。\n2．腹泻型：泄泻、大便不成型、腹痛、便血、粘液便、脓血便、肠鸣及排便不畅、不尽、里急后重，伴有消瘦、全身乏力、恶寒、头昏等症。\n3．腹泻便秘交替型：大便时干时稀、时有粘液、便血，伴有腹痛、腹胀等症。\n【临床症状】：\n直肠炎常见于体质虚弱抵抗力低下，心、肺、肝、胃肠道疾病、呼吸道感染、传染病后，大便秘结、腹泻、痔，肛管直肠脱垂，肛瘘、息肉病、肛门直肠狭窄、直肠恶变、直肠损伤、异物等，都可使直肠发炎。\n直肠炎的症状有腹泻、腹痛、腹胀等，需要注意的是，患者常有便秘与腹泻交替，便中含有粘液及血丝，大便时肛门口灼痛。因分泌物刺激，肛门周围表皮脱落，有时成裂口发痒，下腹部胀满不适，食欲不振，体重减轻，全身不适。直肠炎也可引起强烈的肛门疼痛，因此当出现肛门疼痛时，患者应认真诊断，通过电子肛肠镜找出病因，对症治疗。 对直肠炎长期患者或反反复复的患者，建议可以采用中药进行治疗，同时注意一下饮食习惯。\n【注意事项】：\n病人适当休息，进清淡、少渣、营养丰富、无刺激性的食物，并做到心情愉快，劳逸结合。\n 饮食方面患者应该注意以下几点：\n1．高热能、高蛋白质以补偿长期腹泻而导致的营养消耗，可根据病人消化吸收耐受情况循序渐进地提高供给量。一般热能按每日每公斤体重40千卡供给。蛋白质每日每公斤体重1.5克，其中优质蛋白占50%为好。\n2．维生素无机盐要充足以补偿腹泻引起的营养丢失。\n3．限制脂肪和膳食纤维：腹泻常伴有脂肪吸收不良，严重者伴有脂肪泻。因此膳食脂肪量要限制，应采用少油的食物和少油的烹调方法。对伴有脂肪泻者，可采用中链脂肪酸油脂。避免食用含刺激性和纤维高的食物，如辛辣食物、白薯、萝卜、芹菜、生蔬菜、水果以及带刺激性的葱、姜、蒜和粗杂粮、干豆类等。\n4．少食多餐：为减轻肠道负担，以少食多餐方式补充营养摄入量。\n5．膳食安排：急性发作或手术前后采用流食或少渣半流食，食物内容：米汤、蒸蛋、藉粉、牛奶一般不主张采用。必须禁用蔬菜水果。可将之制成菜水、菜泥、果汁、果泥、果冻等食用。少渣半流可选用含优质蛋白的鱼肉、瘦肉、蛋类制成软而少油的食物，如氽鱼丸、芙蓉粥、鸡丝龙须面及面包类；对病情严重不能口服者可用管饲要素膳或静脉营养支持，待营养状况改善后逐渐增加口服自然食物。',
              style: TextStyle(
                fontSize: 16,
              ),
            ),
          ],
        ),
      ),
    );
  }
}


